{
  "Cars":[
      {"id":1,
      "title":"MERCEDES GLC",
      "brand":1,
      "country":"Germany",
      "price":"61,500€",
      "description":"For many years, Mercedes was curiously absent from the mid-sized premium SUV market in this country - but they're a major player now. This GLC model, launched in 2015, was the German brand's answer to prestige players in this segment like the Audi Q5, the BMW X3 and the Range Rover Evoque. It may have been late to the party but it proved to be an impressively strong contender. Let's check the pre-facelift version out as a used buy.\r\n\r\nHistory\r\n\r\nThe early part of the 21st century's second decade was characterised by the Mercedes brand's expansion into almost every conceivable market niche; compact Crossovers, lifestyle estates, MPVs, supercars - even Plug-in and all-electric technology. No potential industry segment, it seemed, was left uncovered. Except, in the UK at least, for one of the most obvious. That for premium mid-sized SUVs - a car like this, the GLC.\r\n\r\nIt wasn't that Mercedes couldn't take on key players in this class like Audi's Q5, BMW's X3 and assorted Land Rover products. On the contrary, between 2009 and 2015, the brand had a GLK-Class model that did exactly that in a way so effective that it became the company's best selling SUV. Unfortunately though - and rather astonishingly - the GLK wasn't ever engineered for manufacture in right hand drive form. Big mistake.\r\n\r\nThat one oversight must have cost Mercedes millions in terms of lost sales, not only in the British market but also in other right hand drive territories like Australia, South Africa and Japan. Still, times changed, heads rolled and the Three-Pointed Star got back on track when this GLC model was launched in the Autumn of 2015, priced and positioned directly against its key premium SUV rivals and offering the kind of unique selling point that all new segment entrants should have. Buyers got an option that no direct rival of the time could match - the kind of sophisticated air suspension system previously limited only to much larger and more expensive SUVs like Mercedes' own GLE and GLS models.\r\n\r\nIn fact, there's was much about this car that democratised pricier SUV luxury, whether the customer's focus was on media connectivity, cutting edge safety or cabin aesthetics. As with the larger GLE model, there was even a separate bodystyle, the 'GLC Coupe', aimed at more fashionable folk looking at cars like BMW's X4, Jaguar's F-PACE or the Range Rover Evoque. Here though, our focus will be on original versions of the standard version. This car was significantly updated in mid-2019, but it's the pre-facelift versions we check out from a used market perspective here.\r\n\r\nWhat You Get\r\nUp front, the look of the standard GLC SUV model is characteristically SUV, with short overhangs and an upright, three-dimensional twin-louvred radiator grille. This is dominated by the usual centrally positioned Three-Pointed Star and flanked by intricately formed jewel-like headlamps incorporating LED daytime running light strips and optional full-LED illumination. The bumper gets an integrated under-guard and comes in three distinct guises to suit either standard, off-road-orientated or sporty AMG models.\r\n\r\nView the car in profile and the C-Class ancestory is evident in the gently sloping dropping line just below the door handles, a distinctive characteristic of that car. This rising lower crease also plays its part in giving the flanks some shape, connecting wheel arches featuring matt black cladding that can house rims varying from 17 to 21-inches in size. Strong rear haunches and standard rear privacy glass complete the effect. The broad, muscular shoulderline is carried through into the rear, where silver-trimmed tailpipes feature on most models and the split tail lamps feature distinctive LED illumination. As at the front, different bumper designs are provided for different variants.\r\n\r\nFurther signs of this car's C-Class model heritage are evident once you take a seat behind the wheel - which means that it's very nice indeed. Get into one of the brand's older generation models and you're faced with a functional cabin that's about as stylish as Angela Merkel. This more modern design could hardly be more different, with eye-catching metal highlights, a beautifully-judged balance of high quality materials and a broad eye-catching centre console sweeping between the front seats.\r\n\r\nTake a look around once you're comfortably seated inside and the two staples of current Mercedes cabin style are present and correct. There are five round silver-trimmed air vents and above the three in the centre sits a prominent iPad-style infotainment screen, its free-standing positioning smacking either of after-thought or inspired design, depending on your point of view.\r\n\r\nAnd in the back? Well if you've been persuaded to buy one of these in preference to a C-Class Estate, it's here that that decision will pay off. The GLC has 33mm more length in its wheelbase than one of those would offer and nearly all of that has been used for the benefit of rear folk who as a result enjoy significantly improved room for their legs and knees. Let's finish by taking a look at luggage space, accessed via the standard electrically-operated tailgate. Mercedes obviously benchmarked BMW's X3 here, for the load capacities on offer match those of that Munich model exactly. Specifically, you're talking 550-litres.\r\n\r\nWhat You Pay\r\n\r\nWe'll quote you prices based on the standard SUV body style. Prices for this first generation GLC start at around £20,700 for the entry-level 'SE'-spec 220d diesel, with values rising to around £27,700 for a later '18-spec car. Add around £1,000 more for mid-range 'Sport' trim, or around £2,000 for more dynamic 'AMG Line'-spec. We'd try for the slightly more potent 250d version, which only costs around £500 more than the 220d. The six cylinder 350d diesel starts from around £25,000 on a '16-plate with 'SE' trim, with values rising to around £30,500 for an '18-plated car; add on the same kind of premiums for 'Sport' or 'AMG Line;' trim. As for the V6 petrol Mercedes-AMG GLC 43 performance model, well values for that start at around £30,000 for a '15-plated car, rising to around £40,000 for an early '19-plated model.\r\n\r\nWhat to Look For\r\n\r\nMost GLC owners in our survey were satisfied, but inevitably, there were some who'd experienced problems. The most common problem we came across seems to be an inherent fault with all right hand drive GLCs; if you turn full lock, left or right, the outside tyre skips and jumps. The larger the wheel the noisier it is. This is a basic steering geometry issue and you need to check for it on your test drive. One owner replaced all brake disks due to bad vibration. A month ago the power steering stopped working as he went around a bend and the car had to be towed away prior to a complete replacement steering rack. In another instance, an owner's gearbox failed.\r\n\r\nOtherwise, it's just the usual stuff. Check for signs of damage to the bodywork and alloy wheels. Even though all GLCs came with parking sensors, there may be some and top-spec variants with wide alloy rims are particularly prone to scratches. Check for uneven panel gaps and paint flaws. Inspect the electrics and the air conditioning functionality - it should blow out really chilled air. Some owners in our survey complained of un-Mercedes-like squeaks and rattles; try the car you have in mind across a bumpy bit of road to try and expose any nasty noises.\r\n\r\nReplacement Parts\r\n\r\n(approx based on a 2015 GLC 220d - Ex Vat) A fuel filter is around £105. Front brake pads sit in the £82 bracket for a set. Rear brake discs can cost in the £330 bracket. An oil filter is around £8-£10. A radiator costs in the £155-£250 bracket.\r\n\r\nOn the Road\r\n\r\nUnder the bonnet, the line-up for our market was mainly based around 2.1-litre diesel power, offered with either 170bhp in the base GLC 220d or 204bhp in the pokier GLC 250d variant. A six cylinder GLC 350d variant was added in 2016, about the same time as the Mercedes-AMG '43' and '63' petrol performance versions were announced. Across the range, power is transmitted to the tarmac via a smooth standard 9G-TRONIC nine-speed auto gearbox and permanent 4MATIC 4WD. Plus you can alter the feel of your car via an 'AGILITY SELECT' driving dynamics system, one of those set-ups that allows you to alter steering feel, gear change timings, throttle response and suspension feel at the press of a button.\r\n\r\nThis package will have even more of an effect if you get a car whose original owner paid extra for the optional 'AIR BODY CONTROL' air suspension system that's still an unusual feature in this class. This makes a big difference to on road sportiness and comfort and can even more dramatically affect the extent to which you'll be able to use your GLC off road. A surprising amount is possible at the wheel of his car off piste, but most likely owners will be more interested in the model's impressive efficiency figures. With either of the four cylinder diesel variants, you're looking at 56.5mpg on the combined cycle and 129g/km of CO2.\r\n\r\nOverall\r\n\r\nSo, the wait was worth it. Mercedes first real attempt at creating a design properly equipped to target front-running models in the premium mid-sized SUV segment turned out to be the impressively complete all-rounder we hoped it would be. Where its left hand drive-only GLK predecessor traded on brand image and not a lot else, this car is there or thereabouts in almost any important area you care to mention.\r\n\r\nMuch of that of course, is down to the way the GLC's engineering borrows hugely from other Mercedes models, though to be fair, it also has a few tricks of its own. Namely the option of the kind of air suspension system that previously was largely limited to much bigger SUVs. That plays a key part in creating far greater reserves of off road ability than you'd normally expect a car of this kind to be able to offer. A pity then, that very few owners will ever get to experience it.\r\n\r\nWe think though, that these buyers will still be pretty satisfied: there is, after all, a combination here of frugality, space and comfort that rivals will find very hard to beat. Yes, some potential customers may feel that there are more dynamic choices they could make in this segment, but these people could consider the sleeker Coupe version of this car - which could very well make them think again.\r\n\r\nMost though, will value the all-round practicality of this standard model. No, it can't give you the seven-seat capacity of a rival Land Rover Discovery Sport. Or the racetrack responses of a similarly-sized Porsche Macan. Otherwise though, it's hard to see how you' be disappointed by this Mercedes. Yes, it came late to the SUV party, but it arrived well prepared to create quite a stir.","cover":"https://res.cloudinary.com/dc57qsnnq/image/upload/v1588162607/Car%20Models/MERCEDES/glc-1_c4qhk1.png",
      "cover1":"https://res.cloudinary.com/dc57qsnnq/image/upload/v1588162608/Car%20Models/MERCEDES/glc-2_kysbs0.png",
      "cover2":"https://res.cloudinary.com/dc57qsnnq/image/upload/v1588162604/Car%20Models/MERCEDES/glc-3_sbwnlj.png",
      "fuel":"diesel",
      "transmission":"manual",
      "year":"2019",
      "car_type":"Mid-size SUV",
      "video":"https://www.youtube.com/embed/pa3nAOTYWpU"}]
}